#include <stdio.h>

int main(){

    // ============== 左移 =====================
    // 左移一位相当于*2,那么 m<<n 相当于m*2的n次方

    printf("%d\n",1<<2); // 2的2次方
    printf("%d\n",1<<10); // 2的10次方
    printf("%d\n",2<<2); // 2的2次方
    printf("%d\n",3<<4); // 3*2*2*2*2 也就是


    // 移出太多成负数
    int i = 2e9;
    printf("%d\n",i<<1); // i*2 

    // =================== 异或 =====================
    // ******** 使用^切换变量 0 1  ********
    
    // if 判断
    
    // if(toggle){
    //    toggle = 0;
    // }else{
    //    toggle = 1;
    // }

    // 三目运算符

    // toggle = toggle?0:1;

    
    // after 
    // toggle ^=1;

    int m = 0;
    printf("%d\n",m^=1);
    
    // ******** 使用^完成值交换 ********
    // 之前可以借助于临时变量
    // int temp = a; a = b; b = temp;
    // 或者借助数组
    // b = [a,a=b][0];

    // 现在我们可以使用如下方式完成：
    int a = 7000; 
    int b = 1555;
    a ^= b;
    b ^= a;
    a ^= b;

    printf("a is:%d,b is:%d\n",a,b);


    // ******** 使用^断定两数同号 ********
   
    printf("同号断定为：%d\n",(a^b)>=0);
    b = -128;
    printf("同号断定为：%d\n",(a^b)>=0);

    // ******** 使用^断定两数中是否 不相等 ********
    // if (a != 1171) 可以写为 if (a^1171)

    if(a^7000){
        printf("a 不等于7000\n");
    }else{
        printf("a 等于7000\n");

    }

    printf("相等断定为：%d\n",a^7700);


    // ===================  &  =====================
    // 使用&判断奇偶性
    // 偶数 & 1 = 0;
    // 奇数 & 1 = 1;

    // 使用 n & (n-1) 如果结果为0表示是2的整数次幂

    if(!(a&(a-1))){
        printf("a 是2的整数次幂");
    }


    // ===================  !  =====================
    // 使用!!将数字转为布尔值,基于所有的非0值都是true
    printf("%d\n",!!7);
    printf("%d\n",!!0);
    printf("%d\n",!!-1);
    printf("%d\n",!!0.11);

}






/**
 * 
 JavaScript中完全套用了Java中的按位运算，包括按位与&, 按位或|,
 按位异或^, 按位非~ , 左移<< , 带符号右移>> 和用0补足的右移>>>

 这套运算符适用于整数，所以对JavaScript不用，因为JS的内部所有数
 字都以双精度保存。

 1<<2;

 // ===================  ~ >> << >>> |  =====================
    Math.floor()
    console.log("%d\n",~~11.71);        // 11
    console.log("%d\n",11.71>>0);       // 11
    console.log("%d\n",11.71<<0);       // 11
    console.log("%d\n",11.71|0);        // 11
    console.log("%d\n",11.71>>>0);      // 11

请注意 >>> 不可对负数取整



    // JS中Math.round() 可以使用 A + 0.5 | 0 来完成,
    // 如果是负数 A -0.5 | 0;

 * 
 */